# Import modul dan library yang dibutuhkan

In [24]:
import kelas as k

In [25]:
import os

# Membuat objek

In [26]:
df = k.data()

# Mulai membuat tabel, mengisi tabel, menampilkan tabel dan menyimpan tabel

In [27]:
df.tabel() # Membuat tabel pada objek df
df.baris() # Menentukan banyaknya data yang ingin diinput pada tabel dan mengisi data tersebut
df.cetak_tabel() # Menampilkan tabel yang sudah diisi

Masukkan banyaknya data yang ingin dimasukkan : 2
Masukkan nama mahasiswa 	: Muhammad Sholih Fajri
Masukkan nim mahasiswa 		: 11150970000006
Masukkan nilai formatif 	: 90
Masukkan nilai uts 		: 80
Masukkan nilai uas 		: 85
Masukkan nama mahasiswa 	: Yessica Tamara
Masukkan nim mahasiswa 		: 11190970000009
Masukkan nilai formatif 	: 90
Masukkan nilai uts 		: 90
Masukkan nilai uas 		: 90

              NIM                   Nama Formatif UTS UAS  Nilai Akhir Huruf
0  11150970000006  Muhammad Sholih Fajri       90  80  85         85.5     A
1  11190970000009         Yessica Tamara       90  90  90         90.0     A

In [28]:
df1 = df.cetak_tabel() # Menyimpan tabel yang sudah diisi ke dalam variabel df1
df1

              NIM                   Nama Formatif UTS UAS  Nilai Akhir Huruf
0  11150970000006  Muhammad Sholih Fajri       90  80  85         85.5     A
1  11190970000009         Yessica Tamara       90  90  90         90.0     A

In [29]:
file = 'test.xlsx' # Menentukan nama file tabel
df1.to_excel(file, index=False) # Menyimpan tabel dengan nama file seperti di atas